slides/Midterm-Review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Midterm-Review</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Midterm-Review"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-18T11:17-0700"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Midterm-Review</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Midterm</a>
<ul>
<li><a href="#sec-1-1">1.1 Covers</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Browsers</a>
<ul>
<li><a href="#sec-2-1">2.1 Answers</a></li>
<li><a href="#sec-2-2">2.2 Homework</a></li>
</ul>
</li>
<li><a href="#sec-3">3 HTML</a>
<ul>
<li><a href="#sec-3-1">3.1 Answers</a></li>
<li><a href="#sec-3-2">3.2 CSS</a></li>
<li><a href="#sec-3-3">3.3 Answers</a></li>
<li><a href="#sec-3-4">3.4 Homework</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Forms</a>
<ul>
<li><a href="#sec-4-1">4.1 Answers</a></li>
<li><a href="#sec-4-2">4.2 Javascript</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 Answers</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 Homework: Madlibs</a></li>
</ul>
</li>
<li><a href="#sec-5">5 URIs &amp; HTTP</a>
<ul>
<li><a href="#sec-5-1">5.1 Answers</a></li>
<li><a href="#sec-5-2">5.2 Web Servers</a></li>
<li><a href="#sec-5-3">5.3 Answers</a></li>
<li><a href="#sec-5-4">5.4 Homework: Telnet</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1 Redirects</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 State &amp; Dynamic Webpages</a>
<ul>
<li><a href="#sec-6-1">6.1 Answers</a></li>
<li><a href="#sec-6-2">6.2 HTTP Data</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1 Answers</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3 Homework</a></li>
<li><a href="#sec-6-4">6.4 Cookies</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1 Answers</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5 REST</a>
<ul>
<li><a href="#sec-6-5-1">6.5.1 Answers</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Midterm &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Designed for <b>1.5 hours</b>, 3 hours available
</li>
<li>May bring <b>8.5x11 cheat sheet</b>
</li>
<li>Question types including:
<ul>
<li>Fill in the blank
</li>
<li>Short sentences
</li>
<li>Multiple choice
</li>
</ul>

</li>
<li>Covers all lectures including REST
</li>
</ul>


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Covers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>Since we didn't have homework on it, won't expect too many technical
     details on REST
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Browsers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>What is the DOM?
</li>
<li>What are the essential tasks of a browser?
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>Browser
<ul>
<li>DNS hostname lookup
</li>
<li>send receive data over TCP/IP via HTTP(S)
</li>
<li>discover and download dependencies
</li>
<li>create DOM
</li>
<li>apply CSS
</li>
<li>Display
</li>
<li>executing code
</li>
<li>Respond to user actions
</li>
</ul>

</li>
<li>Tree structure used to model HTML
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Homework &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>Purpose of homework was to make sure every one tried different browsers
</li>
<li>Think of the trade-offs the browsers made
</li>
<li>Think about what technologies were behind that flexibility and features
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> HTML &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>What are some examples of non-semantic tags?
</li>
<li>What are the advantages of using tags as opposed to ASCII marks?
</li>
<li>What is other example of HyperText?
</li>
<li>What elements are used for 1) the content of the page, 2) the metadata of
    the page?
</li>
</ul>


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li><code>blink</code>, <code>font</code>
</li>
<li>Easier to compose, can't get confused when you want to use markup character
</li>
<li>wiki text
</li>
<li><code>body</code>, <code>head</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> CSS &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>Why separate style and content?
</li>
<li>What does cascading mean?
</li>
<li>What are some CSS selectors?
</li>
<li>When should you use the <code>style</code> HTML attribute?
</li>
</ul>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>You can present content in different ways (like these slides)
</li>
<li>Styles can "cascade" over one another, applying the result of all
     stylesheets to the elements
</li>
<li><code>.class</code> <code>#id</code> <code>parent descendent</code>
</li>
<li>When you don't have access to the stylesheet
</li>
</ul>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Homework &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>Purpose was to use different elements appropriately
</li>
<li><code>table</code> used for tabular data, <code>div</code> for layout
</li>
<li>use CSS instead of <code>font</code> tag to set text styles
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Forms &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>What does the <code>method</code> attribute in the form specify?
</li>
<li>What are some <code>input</code> types?
</li>
<li>Why is Javascript useful with forms?
</li>
<li>Can the server trust data if there is Javascript validation?
</li>
</ul>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>HTTP method, <code>GET</code> or <code>POST</code>
</li>
<li><code>text</code> <code>checkbox</code> <code>password</code>
</li>
<li>Helpful to provide instant validation
</li>
<li>No, must re-validate to avoid manual attacks
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Javascript &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>What are two conceptual ways to remove elements from a page?
</li>
</ul>


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h4>
<div class="outline-text-4" id="text-4-2-1">

<ul>
<li>Set the CSS property (eg. <code>display: hidden</code>) or remove from the DOM
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Homework: Madlibs &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>Purpose was to practice using Javascript
</li>
<li>Get used to event driven nature (stuff happens when you interact with page)
</li>
<li>Pracice updating a page after an interaction
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> URIs &amp; HTTP &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li><code>foo://example.com:8042/over/there/index.dtb?type=animal&amp;name=narwhal#nose</code>
</li>
<li>what are the parts of this URL?
</li>
<li>How is a filesystem like a DOM?
</li>
<li>Does HTTP use relative or absolute paths?
</li>
<li>webservers map _ to resources and return _
</li>
</ul>


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>parts:
<dl>
<dt>foo</dt><dd>schema
</dd>
<dt>example.com</dt><dd>domain / authority
</dd>
<dt>8042</dt><dd>port
</dd>
<dt>/over/there/index.dtb</dt><dd>path
</dd>
<dt>type=animal&amp;name=narwhal</dt><dd>query
</dd>
<dt>nose</dt><dd>fragment
</dd>
</dl>

</li>
<li>both represented by trees
</li>
<li>absolute
</li>
<li>URLs, representations
</li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Web Servers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>What are the <code>OK</code> and <code>NOT FOUND</code> return codes?
</li>
<li>How do we create a custom <code>NOT FOUND</code> page?
</li>
<li>Why is HTTP/1.1 connection reuse helpful?
</li>
</ul>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-5-3">

<ul>
<li><code>200</code>, <code>404</code>
</li>
<li>Write HTML content in the response body
</li>
<li>Setting up connections causes page load latency
</li>
</ul>


</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Homework: Telnet &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-5-4">

<ul>
<li>purpose was to practice speaking HTTP
</li>
<li>HTTP request consists of a method, absolute path, version, headers, and
     body/content
</li>
<li>Browser helps by "following" redirects, running searches, etc.
</li>
</ul>




<pre class="src src-http">PUT /foo HTTP/1.1
Host: localhost

HTTP/1.0 500 INTERNAL SERVER ERROR
Content-Type: text/html; charset=utf-8
Connection: close
Server: Werkzeug/0.8.3 Python/2.7.3
Date: Fri, 05 Oct 2012 07:20:41 GMT
</pre>



</div>

<div id="outline-container-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> Redirects &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h4>
<div class="outline-text-4" id="text-5-4-1">

<ul>
<li>Browswer GETs <a href="http://people.ischool.berkeley.edu/">http://people.ischool.berkeley.edu/</a>~&lt;USER&gt;/server/foo
</li>
<li>Server returns a <code>302</code> with <code>Location</code> /
</li>
<li>Browser GETS <a href="http://people.ischool.berkeley.edu/">http://people.ischool.berkeley.edu/</a>
</li>
<li>Server returns a <code>301</code> with <code>Location</code>  <a href="http://www.people.ischool.berkeley.edu/index.php">http://www.people.ischool.berkeley.edu/index.php</a>
</li>
<li>Browser GETs <a href="http://www.people.ischool.berkeley.edu/index.php">http://www.people.ischool.berkeley.edu/index.php</a>
</li>
<li>(Sometimes would return a https if logged in)
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> State &amp; Dynamic Webpages &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Does HTTP have state?
</li>
<li>How can you tell?
</li>
<li>What are the disadvantages to server generated pages?
</li>
<li>Should images on <code>yelp.com</code> homepage be served dynamically or statically?
</li>
</ul>


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li>No
</li>
<li>It must resend all context for each request
</li>
<li>Usually slower than static
</li>
<li>Static since they do not change
</li>
</ul>


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> HTTP Data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-6-2">

<ul>
<li>Where are query arguments in a <code>GET</code> request?
</li>
<li>Where are query arguements in a <code>POST</code> request?
</li>
<li>Why is <code>Content-Length</code> needed to send data in a <code>PUT</code> request?
</li>
<li>What are some example MIME types?
</li>
</ul>


</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h4>
<div class="outline-text-4" id="text-6-2-1">

<ul>
<li>query section of the URL
</li>
<li>Request body
</li>
<li>So the server knows how long to wait for data
</li>
<li><code>audio/mp4</code> <code>text/html</code>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Homework &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-6-3">

<ul>
<li>Purpose was to practice sending data to the server, see how the server can
     respond dynamically
</li>
<li>Understand how <code>Content-Type</code> affects the interpretation of data
</li>
</ul>


</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Cookies &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-6-4">

<ul>
<li>Why are cookies used?
</li>
<li>In normal usage, how is the cookie data set?
</li>
<li>Cookies are structured as _ - _ pairs
</li>
<li>How do we prevent important cookies from being spied and intercepted?
</li>
<li>Without cookies, can we tell if a user is logged in with a typical <code>GET</code>
    request?
</li>
<li>Why set cookie expire times in 2037?
</li>
</ul>


</div>

<div id="outline-container-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h4>
<div class="outline-text-4" id="text-6-4-1">

<ul>
<li>Synchronize state between client and server
</li>
<li>Set-Cookie server response header (ie by the server)
</li>
<li>key-value
</li>
<li>HTTPS Only cookie attribute
</li>
<li>No
</li>
<li>So we can stay logged in (or at least remembered) after the browser
     restarts
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> REST &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-6-5">

<ul>
<li>What is an example of a RESTful system?
</li>
<li>Is a Noun endpoint / URL an indicator of a non-RESTful, or RESTful system?
</li>
<li>Is using <code>POST</code> for all commands an indicator of a non-RESTful, or RESTful system?
</li>
<li>What is the primary trade-off for composable systems like REST?
</li>
</ul>


</div>

<div id="outline-container-6-5-1" class="outline-4">
<h4 id="sec-6-5-1"><span class="section-number-4">6.5.1</span> Answers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h4>
<div class="outline-text-4" id="text-6-5-1">

<ul>
<li>The Web
</li>
<li>RESTful because a Noun typically indicates a Resource
</li>
<li>non-RESTful because it is not using a Uniform Interface (<code>GET</code>, <code>PUT</code>, &hellip;)
</li>
<li>Flexibility for single-purpose performance
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-10-18T11:17-0700</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
